{
  "schema_version": "2.1",
  "last_updated": "2025-09-02T23:30:00Z",
  "problem_solutions": {
    "EXFAT_DETECTED": {
      "level": "WARNING",
      "title": "Formato exFAT detectado en la tarjeta SD",
      "description": "Tu tarjeta usa el formato exFAT, que es propenso a la corrupción de datos. Se recomienda encarecidamente usar FAT32 para máxima estabilidad.",
      "solution": {
        "description": "Se recomienda respaldar los datos importantes de tu Micro SD, formatearla usando el sistema de archivos FAT32 y luego restaurar tus datos."
      }
    },
    "ESSENTIAL_FOLDERS_MISSING": {
      "level": "CRITICAL",
      "title": "Faltan carpetas esenciales del CFW",
      "description": "No se encontraron directorios críticos como /atmosphere o /bootloader. Es probable que la SD esté corrupta o no esté preparada para arrancar un CFW.",
      "solution": {
        "description": "La estructura de tu SD está incompleta. La mejor solución es realizar una instalación limpia usando el módulo 'Actualización del sistema' de NX Paradox.",
        "action": "GUIDED_INSTALL",
        "context": { "target_module": "CFW_UPDATER" }
      }
    },
    "ARCHIVE_BIT_SET": {
      "level": "CRITICAL",
      "title": "Atributo de 'Archivo' incorrecto detectado",
      "description": "Se detectó que muchos archivos tienen el 'bit de archivo' activado, un problema común tras un apagado incorrecto que impide que Atmosphère funcione.",
      "solution": {
        "description": "Esta es una reparación sencilla que se hace desde Hekate. Sigue estos pasos:\n1. Inicia en Hekate.\n2. Ve a 'Tools' > 'Arch bit • RCM Touch • Pkg1/2'.\n3. Pulsa sobre 'Fix Archive Bit'.\n4. Reinicia la consola.",
        "action": "GUIDED_ASSISTANT"
      }
    },
    "THEME_INCOMPATIBLE": {
      "level": "CRITICAL",
      "title": "Tema personalizado incompatible",
      "description": "Tu versión de firmware es incompatible con temas personalizados, lo que puede causar fallos al arrancar. La solución es eliminar la carpeta de temas.",
      "solution": {
        "description": "Para solucionar el problema de arranque, la aplicación eliminará de forma segura la carpeta que contiene los temas incompatibles.",
        "action": "DELETE_FOLDER"
      }
    },
    "SIGPATCHES_MISSING": {
      "level": "CRITICAL",
      "title": "Sigpatches no encontrados o mal configurados",
      "description": "Tu sistema no está configurado para cargar los parches necesarios. Tus juegos y aplicaciones no oficiales no se iniciarán.",
      "solution": {
        "description": "La forma más segura de restaurar los parches y asegurar la compatibilidad total es reinstalando el pack de CFW completo desde el módulo de 'Actualización del sistema'.",
        "action": "GUIDED_INSTALL",
        "context": { "target_module": "CFW_UPDATER" }
      }
    },
    "GENERIC_CRASH_2168_0002": {
      "level": "CRITICAL",
      "title": "Crash detectado (Error 2168-0002)",
      "description": "Se encontró un reporte de error del sistema. Este código casi siempre significa que un homebrew o módulo es incompatible con tu versión de Firmware/Atmosphère.",
      "solution": {
        "description": "La solución más segura es actualizar tu CFW completo con nuestro último pack verificado para asegurar que todos los componentes sean 100% compatibles.",
        "action": "GUIDED_INSTALL",
        "context": { "target_module": "CFW_UPDATER" }
      }
    }
  }
}
