{
  "schema_version": "1.2",
  "last_updated": "2025-08-31T21:10:00Z",
  "firmware_versions": {
    "18.1.0": {
      "requires_ams_version": "1.7.0",
      "theme_compatible": false,
      "notes": "Los temas personalizados causan un error de arranque en esta versión. Deben ser desactivados."
    },
    "17.0.1": {
      "requires_ams_version": "1.6.2",
      "theme_compatible": true,
      "notes": ""
    }
  },
  "homebrew_conflicts": {
    "MissionControl": {
      "identifier": "/atmosphere/contents/0100000000001013",
      "versions": {
        "0.10.0": {
          "max_fw_version": "17.0.1",
          "incompatible_with_ams": ["1.7.0"],
          "notes": "Tu versión de Mission Control podría no ser compatible con tu firmware actual, causando cuelgues o problemas con los mandos."
        }
      }
    }
  },
  "hekate_compatibility": {
    "6.2.1": {
      "recommended_for_ams": ["1.7.0", "1.7.1"],
      "notes": ""
    },
    "6.1.0": {
      "recommended_for_ams": ["1.6.0", "1.6.1", "1.6.2"],
      "notes": "No se recomienda usar esta versión de Hekate con Atmosphère 1.7.0 o superior."
    }
  },
  "problem_solutions": {
    "EXFAT_DETECTED": {
      "description": "Se recomienda respaldar los datos importantes de tu Micro SD y formatearla usando el sistema de archivos FAT32 para máxima estabilidad y prevenir corrupción de datos."
    },
    "THEME_INCOMPATIBLE": {
      "description": "Tu versión de firmware es incompatible con temas personalizados, lo que puede causar fallos al arrancar. La solución es eliminar la carpeta de temas.",
      "action": "DELETE_FOLDER",
      "context_id": "theme_folder_path"
    },
    "SIGPATCHES_MISSING": {
      "description": "Usa el módulo 'Actualización del sistema' de NX Paradox para reinstalar el pack de CFW más reciente. Esto restaurará los parches correctos y necesarios."
    },
    "BROKEN_PATH_INI": {
      "description": "Edita manualmente el archivo 'bootloader/hekate_ipl.ini' en tu Micro SD y corrige o elimina la línea que apunta al archivo que ya no existe."
    },
    "CORRUPT_INI_FILE": {
      "description": "Tu archivo de configuración de Hekate está dañado. Reemplaza 'bootloader/hekate_ipl.ini' con una copia nueva o de una copia de seguridad."
    },
    "HEKATE_AMS_MISMATCH": {
      "description": "Actualiza Hekate a la última versión para asegurar total compatibilidad y acceso a las nuevas funciones de Atmosphère. Puedes hacerlo desde el módulo 'Actualización del sistema'."
    },
    "MC_FW_INCOMPATIBLE": {
      "description": "Tu versión de Mission Control es incompatible y puede causar errores. La solución recomendada para asegurar la estabilidad es eliminarla.",
      "action": "DELETE_FOLDER"
    }
  }
}
